---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.OpeningId
source: html/b28ad307-6524-98c2-3652-c18770d3e7d2.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.OpeningId Property

The unique identifier for the opening.

## Syntax (C#)
```csharp
public string OpeningId { get; }
```

## Remarks
This identification attribute is composed of the id for the
 parent surface, the prefix "op" and a sequential number, all
 separated by "-". A sample value would be "su-1-op-1".